In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import scipy as sp
import seaborn as sns
import os,sys
import warnings 
warnings.filterwarnings('ignore')

In [2]:
os.listdir()

['test_questions.csv',
 'train_revised_11.09.2018.zip',
 'google-maps-services-python-master',
 'google-maps-services-python-master.zip',
 '.ipynb_checkpoints',
 'sample_submission.csv',
 'preprocess data.ipynb',
 'train_revised.csv',
 'data_information.txt',
 'read_files.txt',
 'model building.ipynb']

In [3]:
train_revised = pd.read_csv('train_revised.csv')
test_questions = pd.read_csv('test_questions.csv')

In [4]:
train_revised.head(2)

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49

In [5]:
train_revised.columns

Index(['ride_id', 'seat_number', 'payment_method', 'payment_receipt',
       'travel_date', 'travel_time', 'travel_from', 'travel_to', 'car_type',
       'max_capacity'],
      dtype='object')

In [6]:
train_revised.keys()

Index(['ride_id', 'seat_number', 'payment_method', 'payment_receipt',
       'travel_date', 'travel_time', 'travel_from', 'travel_to', 'car_type',
       'max_capacity'],
      dtype='object')

In [7]:
train_revised.describe()

            ride_id  max_capacity
count  51645.000000  51645.000000
mean   10188.645793     34.534321
std     2211.295708     18.451193
min     1442.000000     11.000000
25%     8287.000000     11.000000
50%    10353.000000     49.000000
75%    12029.000000     49.000000
max    20117.000000     49.000000

In [8]:
train_revised.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 10 columns):
ride_id            51645 non-null int64
seat_number        51645 non-null object
payment_method     51645 non-null object
payment_receipt    51645 non-null object
travel_date        51645 non-null object
travel_time        51645 non-null object
travel_from        51645 non-null object
travel_to          51645 non-null object
car_type           51645 non-null object
max_capacity       51645 non-null int64
dtypes: int64(2), object(8)
memory usage: 3.9+ MB

In [9]:
# number of unique id's
np.unique(train_revised['ride_id']).shape # this implies there are some id's that are repeated

(6249,)

In [10]:
# number of unique seat number
np.unique(train_revised['seat_number']).shape #61 numbers of unique seats

(61,)

In [11]:
# number of unique payment methods
np.unique(train_revised['payment_method']).shape

(2,)

In [12]:
# number of payment_receipt
np.unique(train_revised['payment_receipt']).shape

(51645,)

In [13]:
# travel_date, travel_time = calculate in months
#travel_from, travel_to = calculate the distance of travel

In [14]:
# car type correlate with distance of travel
np.unique(train_revised['car_type'])

array(['Bus', 'shuttle'], dtype=object)

In [15]:
# max_capacity
np.unique(train_revised['max_capacity'])

array([11, 49])

In [16]:
train_revised.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,7:05,Keroka,Nairobi,Bus,49
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,7:10,Homa Bay,Nairobi,Bus,49
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,7:12,Migori,Nairobi,Bus,49

In [17]:
# travel time

def update_travel_time(data):
    updated_time_in_seconds = 0
    updated_time_list_in_seconds = []
    for kk in data['travel_time']:
        splitted_kk = kk.split(':')
        updated_time_in_seconds = int(splitted_kk[0]) * 60 + int(splitted_kk[1])
        updated_time_list_in_seconds.append(updated_time_in_seconds)
    return np.array(updated_time_list_in_seconds)

train_revised['travel_time_in_seconds'] = update_travel_time(train_revised)

In [18]:
string = '4:54'
string.split(':')

['4', '54']

In [19]:
np.unique(train_revised['travel_from'])

array(['Awendo', 'Homa Bay', 'Kehancha', 'Kendu Bay', 'Keroka', 'Keumbu',
       'Kijauri', 'Kisii', 'Mbita', 'Migori', 'Ndhiwa', 'Nyachenge',
       'Oyugis', 'Rodi', 'Rongo', 'Sirare', 'Sori'], dtype=object)

In [20]:
np.unique(train_revised['travel_to'])

array(['Nairobi'], dtype=object)

In [21]:
train_revised.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity,travel_time_in_seconds
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49,435
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49,432
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,7:05,Keroka,Nairobi,Bus,49,425
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,7:10,Homa Bay,Nairobi,Bus,49,430
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,7:12,Migori,Nairobi,Bus,49,432

In [22]:
updated_train = train_revised.drop('travel_time', axis = 1)

In [23]:
updated_train.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_from,travel_to,car_type,max_capacity,travel_time_in_seconds
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,Migori,Nairobi,Bus,49,435
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,Migori,Nairobi,Bus,49,432
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,Keroka,Nairobi,Bus,49,425
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,Homa Bay,Nairobi,Bus,49,430
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,Migori,Nairobi,Bus,49,432

In [24]:
#dicted_train_car_type = dict(updated_train['car_type'].value_counts())

#plt.bar(dicted_train_car_type.keys(), dicted_train_car_type.values())
#plt.show()

In [25]:
np.unique(updated_train['car_type'])

array(['Bus', 'shuttle'], dtype=object)

In [26]:
car_type_data = pd.get_dummies(updated_train, columns =['car_type'])
            
car_type_data.head()

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_from,travel_to,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,Migori,Nairobi,49,435,1,0
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,Migori,Nairobi,49,432,1,0
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,Keroka,Nairobi,49,425,1,0
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,Homa Bay,Nairobi,49,430,1,0
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,Migori,Nairobi,49,432,1,0

In [27]:
drop_payment_data = car_type_data.drop('payment_receipt', axis = 1)
drop_payment_data.head()

,ride_id,seat_number,payment_method,travel_date,travel_from,travel_to,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle
0,1442,15A,Mpesa,17-10-17,Migori,Nairobi,49,435,1,0
1,5437,14A,Mpesa,19-11-17,Migori,Nairobi,49,432,1,0
2,5710,8B,Mpesa,26-11-17,Keroka,Nairobi,49,425,1,0
3,5777,19A,Mpesa,27-11-17,Homa Bay,Nairobi,49,430,1,0
4,5778,11A,Mpesa,27-11-17,Migori,Nairobi,49,432,1,0

In [28]:
update_payment_data = pd.get_dummies(drop_payment_data, columns = ['payment_method'])
update_payment_data.head()

,ride_id,seat_number,travel_date,travel_from,travel_to,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle,payment_method_Cash,payment_method_Mpesa
0,1442,15A,17-10-17,Migori,Nairobi,49,435,1,0,0,1
1,5437,14A,19-11-17,Migori,Nairobi,49,432,1,0,0,1
2,5710,8B,26-11-17,Keroka,Nairobi,49,425,1,0,0,1
3,5777,19A,27-11-17,Homa Bay,Nairobi,49,430,1,0,0,1
4,5778,11A,27-11-17,Migori,Nairobi,49,432,1,0,0,1

In [29]:
# come up with a new dataframe containing all unique id's and then associated information like mean of the distances, 
# mean of the time interval
def get_days(start_month, number_of_months):
    month_year = {1:31,2:28,3:31,4:30,5:31,6:30,7:31,8:31,9:30,10:31,11:30,12:31}
    compute_1 = 0
    if number_of_months < 12:
        for i in range(start_month, start_month + number_of_months):
            if i > 12:
                j = i - 12
                compute_1 += month_year[j]
            else:
                compute_1 += month_year[i]
            
    elif number_of_months == 12:
        compute_1 = 365
        
    elif number_of_months > 12 and number_of_months < 24:
        compute_1 = 365
        difference = number_of_month - 12
        for i in range(start_month,start_month + difference):
            if i > 12:
                j = i - 12
                compute_1 += month_year[j]
            else:
                comput_1 += month_year[i]
        
    else:
        compute_1 = 365 *2
    return compute_1



def calculate_time_frame(data):
    data_column = data['travel_date']
    month_year = {1:31,2:28,3:31,4:30,5:31,6:30,7:31,8:31,9:30,10:31,11:30,12:31}
    output_list = []
    for dat in data_column:
        splitted_data = dat.split('-')
        date, month, year = int(splitted_data[0]), int(splitted_data[1]), int(splitted_data[2])
        current_date, current_month, current_year = 22,10,18
        if (current_year - year) == 1:
            compute_months_till_now = 12 - month + current_month
            number_of_days = get_days(month, compute_months_till_now)
            output_list.append(number_of_days)
        else:
            output_list.append(100)
    return np.array(output_list)


update_payment_data['new_time_frame'] = calculate_time_frame(update_payment_data)

In [30]:
drop_travel_date_data = update_payment_data.drop('travel_date', axis = 1)
drop_travel_date_data.head()

,ride_id,seat_number,travel_from,travel_to,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle,payment_method_Cash,payment_method_Mpesa,new_time_frame
0,1442,15A,Migori,Nairobi,49,435,1,0,0,1,365
1,5437,14A,Migori,Nairobi,49,432,1,0,0,1,334
2,5710,8B,Keroka,Nairobi,49,425,1,0,0,1,334
3,5777,19A,Homa Bay,Nairobi,49,430,1,0,0,1,334
4,5778,11A,Migori,Nairobi,49,432,1,0,0,1,334

# using google maps API to calculate the distances from column (travel_from) to column(travel_to) to have a new column called 'distance'

In [31]:
from_location = drop_travel_date_data['travel_from'].unique()

In [32]:
import urllib.request
import json
'https://maps.googleapis.com/maps/api/distancematrix/json?origins=Seattle&destinations=San+Francisco&key=YOUR_API_KEY'

size_locations = len(from_location)
to_location = np.unique(drop_travel_date_data['travel_to']) * size_locations
key = 'AIzaSyCLNO5mol_LjqDuOkTKLBke4Q9de-6GVy4'


def get_me_distance_map(from_location, to_location, key):
    for i, j in zip(from_location, to_location):
        endpoint = 'https://maps.googleapis.com/maps/api/distancematrix/json?'
        api_key = key
        origin, destination = i.replace(' ', '+'), j.replace(' ', '+')
        nav_request = 'origin=()&destination=()&key=()'.format(origin, destination, api_key) 
        
        request = endpoint + nav_request
        response = urllib.request.urlopen(request).read()

In [88]:
origin, destination, api_key = 'Migori', 'Nairobi', 'AIzaSyBMuMBXYBhOjjy7C2MckixJ_jPUWN6imVk'
endpoint = 'https://maps.googleapis.com/maps/api/distancematrix/json?'
nav_request = 'origins=kendu&destinations=Nairobi&key=AIzaSyBMuMBXYBhOjjy7C2MckixJ_jPUWN6imVk'#.format(origin, destination, api_key)
request = endpoint + nav_request
response = urllib.request.urlopen(request).read()
f = open('read_files.txt', 'w')
f.writelines(str(response))
f.close()

In [89]:
request

'https://maps.googleapis.com/maps/api/distancematrix/json?origins=kendu&destinations=Nairobi&key=AIzaSyBMuMBXYBhOjjy7C2MckixJ_jPUWN6imVk'

In [48]:
def find_distance_and_location(origin, destination):
    endpoint = 'https://maps.googleapis.com/maps/api/distancematrix/json?'
    nav_request = 'origins=%s&destinations=%s&key=AIzaSyBMuMBXYBhOjjy7C2MckixJ_jPUWN6imVk' %(origin, destination)
    request = endpoint + nav_request
    response = urllib.request.urlopen(request).read()
    f = open('read_files.txt', 'w')
    f.writelines(str(response))
    f.close()
    return response

In [90]:
req = find_distance_and_location('Robi', 'Nairobi')
req

b'{\n   "destination_addresses" : [ "Nairobi, Kenya" ],\n   "origin_addresses" : [ "535 W Main St, Murfreesboro, TN 37129, USA" ],\n   "rows" : [\n      {\n         "elements" : [\n            {\n               "status" : "ZERO_RESULTS"\n            }\n         ]\n      }\n   ],\n   "status" : "OK"\n}\n'

In [91]:
rep = find_distance_and_location('Awendo', 'Nairobi')
rep

b'{\n   "destination_addresses" : [ "Nairobi, Kenya" ],\n   "origin_addresses" : [ "Sare, Kenya" ],\n   "rows" : [\n      {\n         "elements" : [\n            {\n               "distance" : {\n                  "text" : "350 km",\n                  "value" : 350021\n               },\n               "duration" : {\n                  "text" : "6 hours 41 mins",\n                  "value" : 24058\n               },\n               "status" : "OK"\n            }\n         ]\n      }\n   ],\n   "status" : "OK"\n}\n'

In [93]:
travel_from = np.unique(drop_travel_date_data['travel_from'])

In [83]:
for location in travel_from:
    loc = location.replace(' ', '+')
    request = find_distance_and_location(loc, 'Nairobi')
    print(request[200:260], 'from ', location, 'to ', 'Nairobi')

b'    "text" : "350 km",\n                  "value" : 350021\n  ' from  Awendo to  Nairobi
b'        "text" : "363 km",\n                  "value" : 36278' from  Homa Bay to  Nairobi
b'        "text" : "377 km",\n                  "value" : 37746' from  Kehancha to  Nairobi
b'         "text" : "346 km",\n                  "value" : 3455' from  Kendu Bay to  Nairobi
b'      "text" : "280 km",\n                  "value" : 279853\n' from  Keroka to  Nairobi
b'      "text" : "294 km",\n                  "value" : 294026\n' from  Keumbu to  Nairobi
b'     "distance" : {\n                  "text" : "270 km",\n   ' from  Kijauri to  Nairobi
b'     "text" : "306 km",\n                  "value" : 305550\n ' from  Kisii to  Nairobi
b'     "text" : "400 km",\n                  "value" : 399980\n ' from  Mbita to  Nairobi
b'             "text" : "371 km",\n                  "value" : ' from  Migori to  Nairobi
b'      "text" : "370 km",\n                  "value" : 370147\n' from  Ndhiwa to  Nairobi
b'           "text" : "325 km",\n                  "value" : 32' from  Nyachenge to  Nairobi
b'      "text" : "331 km",\n                  "value" : 331114\n' from  Oyugis to  Nairobi
b' : "ZERO_RESULTS"\n            }\n         ]\n      }\n   ],\n   ' from  Rodi to  Nairobi
b'     "text" : "331 km",\n                  "value" : 330851\n ' from  Rongo to  Nairobi
b'status" : "ZERO_RESULTS"\n            }\n         ]\n      }\n  ' from  Sirare to  Nairobi
b'             "text" : "10,027 km",\n                  "value"' from  Sori to  Nairobi

In [92]:
"""
Awendo = 350
Homa Bay = 363
Kehancha = 377
kendu bay = 346
keroka = 280
keumbu = 294
kijauri = 270
kisii = 306
Mbita = 400
Migori = 371
Ndhiwa = 370
Nyachenge = 325
Oyugis = 331
Rodi = 0 its 36mins by car to Nairobi # 27.2
Rongo = 331
Sirare = 0 its 26 mins by car to Nairobi # 10.9
Sori = 10,027
"""

'\nAwendo = 350\nHoma Bay = 363\nKehancha = 377\nkendu bay = 346\nkeroka = 280\nkeumbu = 294\nkijauri = 270\nkisii = 306\nMbita = 400\nMigori = 371\nNdhiwa = 370\nNyachenge = 325\nOyugis = 331\nRodi = 0 its 36mins by car to Nairobi # 27.2\nRongo = 331\nSirare = 0 its 26 mins by car to Nairobi # 10.9\nSori = 10,027\n'

In [100]:
distance_matrix = {'Awendo': 350, 'Homa Bay': 363, 'Kehancha': 377, 'Kendu bay': 346,
                  'Keroka':280, 'Keumbu':294, 'Kijauri':270, 'Kisii': 306, 'Mbita': 400,
                  'Migori': 371, 'Ndhiwa': 370, 'Nyachenge': 325,'Oyugis': 331, 'Rongo':331, 'Rodi': 30,
                  'Sirare': 15, 'Sori': 10027}


def apply_distance_matrix(key):
    value = int()
    if key in distance_matrix.keys():
        value = distance_matrix[key]
    else:
        pass
    return value


final = drop_travel_date_data['travel_from'].apply(apply_distance_matrix)

In [101]:
drop_travel_date_data['travel_from'].value_counts()

Kisii        22607
Migori        7027
Homa Bay      6304
Sirare        4449
Rongo         3928
Kehancha      1909
Awendo        1788
Kijauri       1031
Keroka         988
Nyachenge      512
Rodi           405
Mbita          378
Ndhiwa         236
Sori            55
Keumbu          22
Oyugis           5
Kendu Bay        1
Name: travel_from, dtype: int64

In [102]:
final.value_counts()

306      22607
371       7027
363       6304
15        4449
331       3933
377       1909
350       1788
270       1031
280        988
325        512
30         405
400        378
370        236
10027       55
294         22
0            1
Name: travel_from, dtype: int64

In [103]:
!pip install googlemaps

Collecting googlemaps
  Downloading https://files.pythonhosted.org/packages/5a/3d/13b4230f3c1b8a586cdc8d8179f3c6af771c11247f8de9c166d1ab37f51d/googlemaps-3.0.2.tar.gz
Requirement already satisfied: requests<3.0,>=2.11.1 in /home/odemakinde/cd/lib/python3.6/site-packages (from googlemaps) (2.18.4)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /home/odemakinde/cd/lib/python3.6/site-packages (from requests<3.0,>=2.11.1->googlemaps) (3.0.4)
Requirement already satisfied: idna<2.7,>=2.5 in /home/odemakinde/cd/lib/python3.6/site-packages (from requests<3.0,>=2.11.1->googlemaps) (2.6)
Requirement already satisfied: urllib3<1.23,>=1.21.1 in /home/odemakinde/cd/lib/python3.6/site-packages (from requests<3.0,>=2.11.1->googlemaps) (1.22)
Requirement already satisfied: certifi>=2017.4.17 in /home/odemakinde/cd/lib/python3.6/site-packages (from requests<3.0,>=2.11.1->googlemaps) (2018.8.24)
Building wheels for collected packages: googlemaps
  Running setup.py bdist_wheel for googlemaps ... done
  Stored in directory: /home/odemakinde/.cache/pip/wheels/3c/3f/25/ce6d7722dba07e5d4a12d27ab38f3d7add65ef43171b02c819
Successfully built googlemaps
Installing collected packages: googlemaps
Successfully installed googlemaps-3.0.2
You are using pip version 18.0, however version 18.1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [118]:
import googlemaps
gmaps = googlemaps.Client(key = api_key)
distance = gmaps.distance_matrix('Rongo', 'Nairobi')
distance

{'destination_addresses': ['Nairobi, Kenya'],
 'origin_addresses': ['Rongo, Kenya'],
 'rows': [{'elements': [{'distance': {'text': '331 km', 'value': 330851},
     'duration': {'text': '6 hours 21 mins', 'value': 22875},
     'status': 'OK'}]}],
 'status': 'OK'}

In [127]:
distance['rows'][0]['elements'][0]['distance']['value']

330851

In [129]:
travel_from

array(['Awendo', 'Homa Bay', 'Kehancha', 'Kendu Bay', 'Keroka', 'Keumbu',
       'Kijauri', 'Kisii', 'Mbita', 'Migori', 'Ndhiwa', 'Nyachenge',
       'Oyugis', 'Rodi', 'Rongo', 'Sirare', 'Sori'], dtype=object)

In [132]:
def find_distance(location):
    gmaps = googlemaps.Client(key = api_key)
    distance = gmaps.distance_matrix(location, 'Nairobi')
    return location, distance['rows'][0]['elements'][0]['distance']['value']


for location in travel_from:
    try:
        a, b = find_distance(location)
        print(a,b)
    except KeyError:
        print(location, 0)
    finally:
        pass

Awendo 350021
Homa Bay 362787
Kehancha 377463
Kendu Bay 345579
Keroka 279853
Keumbu 294026
Kijauri 270430
Kisii 305550
Mbita 399980
Migori 371122
Ndhiwa 370147
Nyachenge 324654
Oyugis 331114
Rodi 0
Rongo 330851
Sirare 0
Sori 10026701

In [107]:
drop_travel_date_data['travel_from'] = final
data = drop_travel_date_data.drop('travel_to', axis = 1)

In [108]:
data.shape

(51645, 10)

In [109]:
data.head()

,ride_id,seat_number,travel_from,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle,payment_method_Cash,payment_method_Mpesa,new_time_frame
0,1442,15A,371,49,435,1,0,0,1,365
1,5437,14A,371,49,432,1,0,0,1,334
2,5710,8B,280,49,425,1,0,0,1,334
3,5777,19A,363,49,430,1,0,0,1,334
4,5778,11A,371,49,432,1,0,0,1,334

In [141]:
this_data = data['seat_number'].unique().tolist()

In [115]:
val = {11: 0, 49: 1}
def apply_max_capacity(key):
    value = int()
    if key in val.keys():
        value = val[key]
    else:
        pass
    return value
data['max_capacity'] = data['max_capacity'].apply(apply_max_capacity)

In [116]:
data.head()

,ride_id,seat_number,travel_from,max_capacity,travel_time_in_seconds,car_type_Bus,car_type_shuttle,payment_method_Cash,payment_method_Mpesa,new_time_frame
0,1442,15A,371,1,435,1,0,0,1,365
1,5437,14A,371,1,432,1,0,0,1,334
2,5710,8B,280,1,425,1,0,0,1,334
3,5777,19A,363,1,430,1,0,0,1,334
4,5778,11A,371,1,432,1,0,0,1,334

In [142]:
sorted_seat = {}
count = 0
for seat in data['seat_number'].unique().tolist():
    sorted_seat[seat] = count
    count += 1
sorted_seat.values()

dict_values([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60])

In [143]:
def apply_sorted_seat(seat):
    value = int()
    if key in sorted_seat.keys():
        value = sorted_seat[key]
    else:
        pass
    return value
data['seat_number'] = data['seat_number'].apply(apply_sorted_seat)

In [112]:
data['ride_id'].value_counts()

8454     50
8090     49
10834    49
11382    49
13211    49
12160    48
8340     48
11710    48
12698    48
13031    48
8089     48
7891     48
8545     48
12995    47
12477    47
8660     47
8095     47
8682     47
12664    47
10441    47
8598     47
13639    47
9714     47
13115    47
8622     47
10897    47
12157    47
11565    47
8093     47
12580    47
         ..
9098      1
13192     1
13128     1
9002      1
13064     1
8874      1
6765      1
10859     1
6701      1
12680     1
6477      1
11531     1
7565      1
13736     1
8013      1
6188      1
12329     1
10218     1
12235     1
6060      1
10090     1
7981      1
13800     1
7949      1
5836      1
5804      1
9834      1
9738      1
11755     1
6147      1
Name: ride_id, Length: 6249, dtype: int64

In [144]:
data.to_csv('clustering_analysis.csv')